package com.github.tifezh.kchartlib.chart.entity;

/**
 * 传统大势价格趋势线，它的真正名称叫做非线性加权移动平均线，是由六条非线性加权移动平均线组合而成，每条平均线分别代表着不同时间周期的股价成本状况，方便进行对比分析

 1.PBX1=(收盘价的M1日指数移动平均+收盘价的(M1*2)日简单移动平均+收盘价的(M1*4)日简单移动平均)/3
 2.PBX2=(收盘价的M2日指数移动平均+收盘价的(M2*2)日简单移动平均+收盘价的(M2*4)日简单移动平均)/3
 3.PBX3=(收盘价的M3日指数移动平均+收盘价的(M3*2)日简单移动平均+收盘价的(M3*4)日简单移动平均)/3
 4.PBX4=(收盘价的M4日指数移动平均+收盘价的(M4*2)日简单移动平均+收盘价的(M4*4)日简单移动平均)/3
 5.PBX5=(收盘价的M5日指数移动平均+收盘价的(M5*2)日简单移动平均+收盘价的(M5*4)日简单移动平均)/3
 6.PBX6=(收盘价的M6日指数移动平均+收盘价的(M6*2)日简单移动平均+收盘价的(M6*4)日简单移动平均)/3
 7.参数M1=4, M2=6, M3=9, M4=13, M5=18, M6=24
 * Created by jilucheng on 2018/5/2.
 * PBX指标，数组长度默认为4
 */

public interface IPBX {
    float[] getPBX();
}
